'''написать программу.
которая выводит таблицу значений функций y= -2.4x**2+ 5*x-3
в диапазоне -2 до 2 с шагом 0,5 '''


def main():
    x = -2
    print("*"*20)
    print("x","    |   ", "y")
    print("*" * 20)
    while x <= 2:
            y = -2.4 * x**2 + 5 * x - 3
            print(x , "   |   " , y)
            x = x + 0.5
main()